package Oparators

fun main(){
//Unary prefix and Increment

    //কোটলিনে ইউনারি প্রিফিক্স অপারেটর হিসেবে `++` এবং `--` ব্যবহার করা হয় যা মূলত মান বা ভেরিয়েবলের মান বৃদ্ধি এবং কমানোর জন্য ব্যবহার হয়।
    //
    //- `++` অপারেটরটি ব্যবহার করা হয় যখন আপনি একটি ভেরিয়েবলের মানকে ১ একক বৃদ্ধি করতে চান। উদাহরণস্বরূপ, যদি `a` নামের ভেরিয়েবলের মান ৫ হয় তাহলে `a++` ব্যবহার করলে `a` এর মান ৬ হয়ে যাবে।
    //
    //- `--` অপারেটরটি ব্যবহার করা হয় যখন আপনি একটি ভেরিয়েবলের মানকে ১ একক কমাতে চান। উদাহরণস্বরূপ, যদি `b` নামের ভেরিয়েবলের মান ৭ হয় তাহলে `b--` ব্যবহার করলে `b` এর মান ৬ হয়ে যাবে।
    //
    //এই অপারেটরগুলি মূলত ব্যবহার হয় লুপ বা কন্ডিশনাল স্টেটমেন্টসে যেখানে মান বা কাউন্টারের মান বৃদ্ধি বা কমানোর প্রয়োজন হয়।

//   var i = 0
//   println(++i) প্লাস আগে দিলে 1 হবে
//   rusult = 1

//   var i = 0
//   println(i++) প্লাস পরে দিলে -1 হবে
//   rusult = -1


//    var i = 0
//    println(--i) মাইনাস আগে দিলে ১ হবে
//    Rusult = - 1

//    var i = 0
//    println(i--) মাইনাস পরে দিলে 0 হবে
//    Rusult = 0

}